prices = [57.08, 46.51, 97, 51, 1.76, 20, 25.08, 76, 23.34, 98.90,
          70.01, 63, 39, 90.47, 29, 24, 42, 59.11, 45.78, 48.29,
          8.53, 67, 95, 5.62, 11, 18.34, 13, 64.80, 78, 93, 88.08]

for i in range(len(prices)):
    prices[i] = str(prices[i]).split('.')
    prices[i][0] = f'{prices[i][0]} руб'
    if len(prices[i]) == 2:
         prices[i][1] = f' {int(prices[i][1]):02} коп'
    else:
         prices[i][0] = f'{prices[i][0]} 00 коп'
    prices[i] = (''.join(prices[i]))

print(', '.join(prices))

# Вывести цены, отсортированные по возрастанию, новый список не создавать (доказать, что объект списка после сортировки остался тот же).

prices = [57.08, 46.51, 97, 51, 1.76, 20, 25.08, 76, 23.34, 98.90,
          70.01, 63, 39, 90.47, 29, 24, 42, 59.11, 45.78, 48.29,
          8.53, 67, 95, 5.62, 11, 18.34, 13, 64.80, 78, 93, 88.08]

print(id(prices))
prices.sort()
print(prices)
print(id(prices))

# Создать новый список, содержащий те же цены, но отсортированные по убыванию.
# Вывести цены пяти самых дорогих товаров. Сможете ли вывести цены этих товаров по возрастанию, написав минимум кода?

prices = [57.08, 46.51, 97, 51, 1.76, 20, 25.08, 76, 23.34, 98.90,
          70.01, 63, 39, 90.47, 29, 24, 42, 59.11, 45.78, 48.29,
          8.53, 67, 95, 5.62, 11, 18.34, 13, 64.80, 78, 93, 88.08]

print(id(prices))
prices_high_low = sorted(prices, reverse=True)
print(prices_high_low)
print(id(prices_high_low))

# Вывести цены пяти самых дорогих товаров. Сможете ли вывести цены этих товаров по возрастанию, написав минимум кода?

prices_high_low = sorted(prices)
top_5 = str(prices_high_low).split(',')[-5:]
print(','.join(top_5))
